const ru = {
  translation: {
    serial: {
      notSupported:
        'Подключение к последовательному порту не поддерживается. Чтобы пользоваться мышью и клавиатурой, используйте браузер Chrome для настольных компьютеров.',
      failed:
        'Не удалось установить подключение к последовательному порту. Пожалуйста, попробуйте еще раз.'
    },
    camera: {
      tip: 'Ожидание доступа...',
      denied: 'Доступ отказан',
      authorize:
        'Для удаленного рабочего стола требуется доступ к камере. Пожалуйста, разрешите доступ к камере в настройках браузера.',
      failed: 'Не удалось подключить камеру. Пожалуйста, попробуйте еще раз.'
    },
    modal: {
      title: 'Выберите устройство USB',
      selectVideo: 'Выбрать источник видео',
      selectSerial: 'Выбрать последовательный порт'
    },
    menu: {
      serial: 'Последовательный порт',
      keyboard: 'Клавиатура',
      mouse: 'Мышь'
    },
    video: {
      resolution: 'Разрешение',
      scale: 'Масштаб',
      customResolution: 'Пользовательское',
      device: 'Видеоустройство',
      custom: {
        title: 'Пользовательское разрешение',
        width: 'Ширина',
        height: 'Высота',
        confirm: 'Ок',
        cancel: 'Отмена'
      }
    },
    keyboard: {
      paste: 'Вставить текст',
      virtualKeyboard: 'Виртуальная клавиатура',
      shortcut: {
        title: 'Сочетания клавиш',
        ctrlAltDel: 'Ctrl + Alt + Delete',
        ctrlD: 'Ctrl + D',
        winTab: 'Win + Tab'
      }
    },
    mouse: {
      cursor: {
        title: 'Курсор',
        pointer: 'Указатель',
        grab: 'Захват',
        cell: 'Прицел',
        hide: 'Скрытый'
      },
      mode: 'Режим мыши',
      absolute: 'Абсолютное позиционирование',
      relative: 'Относительное позиционирование',
      direction: 'Направление прокрутки',
      scrollUp: 'Обычное',
      scrollDown: 'Инвертированное',
      speed: 'Скорость прокрутки',
      fast: 'Быстро',
      slow: 'Медленно',
      requestPointer:
        'Используется относительное позиционирование мыши. Чтобы захватить курсор, щелкните по видео на экране'
    },
    settings: {
      language: 'Язык приложения',
      document: 'Документация',
      download: 'Загрузить'
    }
  }
};

export default ru;
