const ru = {
  translation: {
    camera: {
      tip: 'Ожидание доступа...',
      denied: 'Доступ отказан',
      authorize:
        'Для удаленного рабочего стола требуется доступ к камере. Пожалуйста, разрешите доступ к камере в настройках браузера.',
      failed: 'Не удалось подключить камеру. Пожалуйста, попробуйте еще раз.'
    },
    modal: {
      title: 'Выберите устройство USB',
      selectVideo: 'Выбрать источник видео',
      selectSerial: 'Выбрать последовательный порт'
    },
    menu: {
      serial: 'Последовательный порт',
      keyboard: 'Клавиатура',
      mouse: 'Мышь'
    },
    video: {
      resolution: 'Разрешение',
      scale: 'Масштаб',
      customResolution: 'Пользовательское',
      device: 'Видеоустройство',
      custom: {
        title: 'Пользовательское разрешение',
        width: 'Ширина',
        height: 'Высота',
        confirm: 'Ок',
        cancel: 'Отмена'
      }
    },
    keyboard: {
      paste: 'Вставить текст',
      virtualKeyboard: 'Виртуальная клавиатура'
    },
    mouse: {
      cursor: {
        title: 'Курсор',
        pointer: 'Указатель',
        grab: 'Захват',
        cell: 'Прицел',
        hide: 'Скрытый'
      },
      mode: 'Режим мыши',
      absolute: 'Абсолютное позиционирование',
      relative: 'Относительное позиционирование',
      direction: 'Направление прокрутки',
      scrollUp: 'Обычное',
      scrollDown: 'Инвертированное',
      requestPointer:
        'Используется относительное позиционирование мыши. Чтобы захватить курсор, щелкните по видео на экране'
    },
    settings: {
      title: 'Настройки',
      appearance: {
        title: 'Внешний вид',
        language: 'Язык приложения',
        menu: 'Панель меню',
        menuTips: 'Открыть панель меню при запуске'
      },
      update: {
        title: 'Проверить обновления',
        latest: 'У вас уже последняя версия.',
        outdated: 'Доступно обновление. Вы уверены, что хотите обновить?',
        downloading: 'Загрузка...',
        installing: 'Установка...',
        failed: 'Обновление не удалось. Пожалуйста, попробуйте еще раз.',
        confirm: 'Ок',
        cancel: 'Отмена'
      },
      about: {
        title: 'О системе NanoKVM-USB',
        version: 'Версия',
        community: 'Сообщество'
      }
    }
  }
}

export default ru
